import { Schedule, WeekType } from '@/types';

export const FIT_3_6_1_6sem_2025_SCHEDULE: Schedule = {
    monday: [
        {
            time: '08:00 - 09:25',
            details: { name: 'Программирование серверных кроссплатформенных приложений', type: 'Лабораторная', location: '324-1' }
        },
        {
            time: '09:35 - 11:00',
            details: { name: 'Программирование интернет-серверов', type: 'Лабораторная', location: '309-1' }
        },
        {
            time: '11:25 - 12:50',
            details: { name: 'Технологии разработки веб-приложений', type: 'Лекция', location: '200-3а', instructor: 'Смелов В.В.' }
        },
        {
            time: '13:00 - 14:25',
            weeks: {
                [WeekType.FIRST]: { name: 'Безопасность жизнедеятельности человека', type: 'Лабораторная', location: '151, 153-4' },
            },
        },
    ],
    tuesday: [
        {
            time: '08:00 - 09:25',
            weeks: {
                [WeekType.SECOND]: { name: 'Проектирование и разработка баз данных интернет-приложений', type: 'Лекция', location: '200-3а', instructor: 'Блинова Е.А.' },
            },
        },
        {
            time: '09:35 - 11:00',
            details: { name: 'Тестирование программного обеспечения', type: 'Лекция', location: '200-3а', instructor: 'Сухорукова И.Г.' }
        },
        {
            time: '11:25 - 12:50',
            details: { name: 'Безопасность жизнедеятельности человека', type: 'Лекция', location: '200-3а', instructor: 'Кичкайло О.В.' }
        },
    ],
    wednesday: [
        {
            time: '08:00 - 09:25',
            details: { name: 'Программирование интернет-серверов', type: 'Лекция', location: '200-3а', instructor: 'Смелов В.В.' }
        },
        {
            time: '09:35 - 11:00',
            details: { name: 'Экономика IT-компании', type: 'Лекция', location: '200-3а', instructor: 'Ледницкий А.В.' }
        },
        {
            time: '11:25 - 12:50',
            details: { name: 'Физическая культура', type: 'Семинар', location: '' }
        },
    ],
    thursday: [
        {
            time: '08:00 - 09:25',
            details: { name: 'Проектирование и разработка баз данных интернет-приложений', type: 'Лабораторная', location: '308-1' }
        },
        {
            time: '09:35 - 11:00',
            details: { name: 'Администрирование и безопасность интернет систем', type: 'Лабораторная', location: '309-1' }
        },
        {
            time: '11:25 - 12:50',
            details: { name: 'Информационная безопасность', type: 'Лекция', location: '200-3а', instructor: 'Урбанович П.П.' }
        },
        {
            time: '13:00 - 14:25',
            details: { name: 'Информационная безопасность', type: 'Лабораторная', location: '324-1' }
        },
    ],
    friday: [
        {
            time: '08:00 - 09:25',
            weeks: {
                [WeekType.FIRST]: { name: 'Экономика IT-компании', type: 'Лабораторная', location: '204-1' },
            },
        },
        {
            time: '09:35 - 11:00',
            details: { name: 'Технологии разработки веб-приложений', type: 'Лабораторная', location: '304-4' }
        },
    ],
    saturday: [
        {
            time: '08:00 - 09:25',
            details: { name: 'Программирование серверных кроссплатформенных приложений', type: 'Лекция', location: '200-3а', instructor: 'Смелов В.В.' }
        },
        {
            time: '09:35 - 11:00',
            weeks: {
                [WeekType.FIRST]: { name: 'Экономика IT-компании', type: 'Семинар', location: '334-4' },
                [WeekType.SECOND]: { name: 'Безопасность жизнедеятельности человека', type: 'Семинар', location: '151-4' },
            },
        },
        {
            time: '11:25 - 12:50',
            details: { name: 'Тестирование программного обеспечения', type: 'Лабораторная', location: '209-1' }
        },
        {
            time: '13:00 - 14:25',
            details: { name: 'Администрирование и безопасность интернет систем', type: 'Лекция', location: '408-2', instructor: 'Жук Я.А.' }
        },
    ],
};
